{
  "id": "artophile_center_demo_v1",
  "title": "Онбординг-тренажёр: ведём проект Artophile Center",
  "description": "Диалог-симуляция для новичка-проектного менеджера. Цель — провести клиента от приветствия до заключения контракта на реконструкцию выставочного центра Artophile. 5 основных финалов, 1 повтор на каждый этап.",
  "max_retries": 1,
  "steps": {
    "1": {
      "text": "Клиент: «Здравствуйте! Вы из команды, которая будет вести реконструкцию Artophile Center? Расскажите, пожалуйста, как мы начнём работу»",
      "expected_answers": [
        "Здравствуйте! Да, я ваш менеджер проекта. Расскажите, какие приоритеты для вас самые важные, чтобы мы могли выстроить план работы.",
        "Добрый день! Я буду курировать реконструкцию. Давайте сначала уточним ваши ключевые ожидания — так мы сформируем дорожную карту."
      ],
      "common_mistakes": [
        "Отсутствие приветствия",
        "Сразу перейти к бюджету"
      ],
      "hint": "Поприветствуйте клиента и предложите обсудить его приоритеты, прежде чем переходить к деталям.",
      "on_correct": "2",
      "on_incorrect": "1r"
    },
    "1r": {
      "text": "Попробуйте ещё раз: приветствие + запрос приоритетов клиента.",
      "expected_answers": [
        "Здравствуйте! Я — ваш менеджер проекта. Расскажите, какие ваши приоритеты в реконструкции?"
      ],
      "common_mistakes": [],
      "on_correct": "2",
      "on_incorrect": "outcome_fail_greeting"
    },

    "2": {
      "text": "Клиент: «Нам нужно увеличить площади экспозиции минимум на 30 %, но сохранить исторический фасад. Ещё важно уложиться до октября следующего года.»",
      "expected_answers": [
        "Понял задачи: +30 % экспозиции, фасад без изменений, срок — октябрь следующего года. Давайте уточним ориентировочные метрики площади и текущие ограничения конструкций."
      ],
      "common_mistakes": [
        "Игнорировать требование по фасаду",
        "Не уточнять ограничения"
      ],
      "hint": "Переформулируйте запрос клиента, убедитесь, что зафиксировали все три параметра (площадь, фасад, срок) и предложите уточнить детали.",
      "on_correct": "3",
      "on_incorrect": "2r"
    },
    "2r": {
      "text": "Сформулируйте ответ заново: отзеркальте 3 условия клиента и предложите уточнить детали.",
      "expected_answers": [
        "Вы хотите расширить экспозицию на 30 %, сохранить фасад и закончить к октябрю следующего года. Предлагаю уточнить точные показатели площади и структурные ограничения."
      ],
      "common_mistakes": [],
      "on_correct": "3",
      "on_incorrect": "outcome_fail_requirements"
    },

    "3": {
      "text": "Клиент: «Бюджет ориентировочно 2,5 млн €, но можем обсуждать, если обосновано.»",
      "expected_answers": [
        "Спасибо за ориентир 2,5 млн €. Подготовим оценку с альтернативами и рисками, чтобы вы могли принять решение.",
        "Понял. Составим несколько вариантов сметы вокруг 2,5 млн €, покажем ключевые статьи затрат."
      ],
      "common_mistakes": [
        "Сразу согласиться без оговорки на риски",
        "Назвать фиксированную сумму без расчётов"
      ],
      "hint": "Признайте ориентир бюджета, пообещайте подготовить детальную оценку/варианты и обозначьте, что покажете риски.",
      "on_correct": "4",
      "on_incorrect": "3r"
    },
    "3r": {
      "text": "Снова: поблагодарите за бюджет, пообещайте детальную оценку с вариантами и рисками.",
      "expected_answers": [
        "Спасибо за цифру 2,5 млн €. Подготовим несколько вариантов сметы с учётом рисков."
      ],
      "common_mistakes": [],
      "on_correct": "4",
      "on_incorrect": "outcome_fail_budget"
    },

    "4": {
      "text": "Клиент: «Мы хотели бы увидеть первый драфт плана через две недели. Реально?»",
      "expected_answers": [
        "Да, за две недели подготовим драфт плана. Он будет включать график работ, бюджетные варианты и основные риски.",
        "Возможно. За 14 дней подготовим предварительный план со сроками, сметой и рисками."
      ],
      "common_mistakes": [
        "Обещать детальный рабочий проект",
        "Отказ без предложения альтернативы"
      ],
      "hint": "Согласитесь на драфт, обозначьте состав драфта (сроки, бюджет, риски).",
      "on_correct": "5",
      "on_incorrect": "4r"
    },
    "4r": {
      "text": "Попробуйте снова: согласие на драфт, уточните, что он будет содержать график, бюджет, риски.",
      "expected_answers": [
        "Да, подготовим драфт плана за две недели: график, бюджет, риски."
      ],
      "common_mistakes": [],
      "on_correct": "5",
      "on_incorrect": "outcome_fail_timeline"
    },

    "5": {
      "text": "Клиент: «Какие основные риски вы видите?»",
      "expected_answers": [
        "Ключевые риски: ограничение по фасаду (сложные согласования), возможные задержки поставщиков и рост стоимости материалов. В драфте заложим резерв по времени и бюджету.",
        "Выделяем риски согласования фасада, цепочки поставок и инфляцию материалов. Предложим контрмеры и резервы."
      ],
      "common_mistakes": [
        "Говорить «рисков нет»",
        "Не назвать меры смягчения"
      ],
      "hint": "Укажите минимум 3 риска (согласования, поставки, стоимость) и скажите, что заложите резервы.",
      "on_correct": "outcome_success_project_signed",
      "on_incorrect": "5r"
    },
    "5r": {
      "text": "Ещё раз: перечислите 3 риска (согласования фасада, поставки, инфляция) + резервы.",
      "expected_answers": [
        "Основные риски: согласования фасада, задержки поставщиков, рост цен. Закладываем резервы."
      ],
      "common_mistakes": [],
      "on_correct": "outcome_success_project_signed",
      "on_incorrect": "outcome_fail_risk"
    }
  },

  "outcomes": {
    "outcome_success_project_signed": "Поздравляем! Клиент удовлетворён ответами и готов подписать контракт на реконструкцию Artophile Center.",
    "outcome_fail_greeting": "Клиент потерял интерес уже на этапе приветствия. Вы не завоевали доверие.",
    "outcome_fail_requirements": "Клиент сомневается, что вы поняли его требования. Диалог прерван.",
    "outcome_fail_budget": "Клиент считает, что вы не умеете управлять бюджетом. Проект передан другой команде.",
    "outcome_fail_timeline": "Клиенту не нравится неопределённость по срокам. Контракт сорван.",
    "outcome_fail_risk": "Клиент не увидел у вас понимания рисков и отложил решение."
  }
}
